Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectFrame Methods
The EmbeddedObjectFrame type exposes the following members.
Methods
Name | Description
GetAxisAlignedBoundingBox
 Returns the bounding box of the frame in the global axis coordinate system.
GetObjectAlignedBoundingBox
 Returns the bounding box of the frame in the local coordinate system.
IsEqual
 Compares the current object with an object of the same type.
Top
See Also
Reference
EmbeddedObjectFrame Class
Tekla.Structures.Drawing Namespace